docs(oms): update cart and order README documentation
- add Dockerfile for OMS service
